import pytest

GOLDEN_TE_RULES_TEST_CASES = [                                          
    ("గుంటూరులో హైకోర్టు ఏర్పాటు చేసారు. ఈ భీకర కాల్పుల్లో నలుగురు ఉగ్రవాదులు హతమయ్యారు.",
     ["గుంటూరులో హైకోర్టు ఏర్పాటు చేసారు.", "ఈ భీకర కాల్పుల్లో నలుగురు ఉగ్రవాదులు హతమయ్యారు"]),
    ("మీ క్రియల ఫలములనుబట్టి మిమ్మును దండించెదను; ఇదే యెహోవా వాక్కు.",
     ["మీ క్రియల ఫలములనుబట్టి మిమ్మును దండించెదను; ఇదే యెహోవా వాక్కు."]),
    ("కోపాన్ని అదుపులో ఉంచుకోవడం ఎలా సాధ్యపడుతుంది? ప్రశాంతంగా ఉంటె సాధ్యపడుతుంది.",
     ["కోపాన్ని అదుపులో ఉంచుకోవడం ఎలా సాధ్యపడుతుంది?", "ప్రశాంతంగా ఉంటె సాధ్యపడుతుంది."]),
    ("వాళ్ళని వదిలేయ్! ప్రాణాలతో వెళ్ళిపోతారు.",
     ["వాళ్ళని వదిలేయ్!", "ప్రాణాలతో వెళ్ళిపోతారు."]),
    ("\"నక్సలైట్లు కూడా దేశభక్తులే బ్రదర్\" అంటూ  సమర్థించటం ఒక విశేషం.",
     ["\"నక్సలైట్లు కూడా దేశభక్తులే బ్రదర్\" అంటూ  సమర్థించటం ఒక విశేషం."])
]

@pytest.mark.parametrize('text,expected_sents', GOLDEN_TE_RULES_TEST_CASES)
def test_te_sbd(te_default_fixture, text, expected_sents):
    """Telugu language SBD tests"""
    segments = te_default_fixture.segment(text)
    assert segments == expected_sents